app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "articles" SET "text" = ?, "title" = ?, "updated_at" = ? WHERE "articles"."id" = 2  [["text", "test89"], ["title", "test9"], ["updated_at", "2014-06-25 03:52:46.222640"]]
---
  def update
  @article = Article.find(params[:id])

    if @article.update(article_params)